# HideClass

## Description
Sets the class visibility of the specified class to hidden (invisible) status.

```pascal
PROCEDURE HideClass(className : STRING);
```

```python

def vs.HideClass(className):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|

## Examples
```pascal
HideClass('Dimension');

```

## See Also
VS Functions:
ShowClass

## Version
Availability: from MiniCAD
## Category
* Classes